Revit 2026 API

# FlexDuctIsFlexDuctTypeId Method

---

Checks if given type is valid flexible duct type.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsFlexDuctTypeId(
	Document document,
	ElementId ductTypeId
)
```
```vb
Public Shared Function IsFlexDuctTypeId (
	document As Document,
	ductTypeId As ElementId
) As Boolean
```
```cpp
public:
static bool IsFlexDuctTypeId(
	Document^ document,
	ElementId^ ductTypeId
)
```
```fsharp
static member IsFlexDuctTypeId :
        document : Document *
        ductTypeId : ElementId -> bool
```

#### Parameters

document Document
     The document.
ductTypeId ElementId
     ElementId of the flexible duct type to check.

#### Return Value

Boolean True if flexible duct type can used for this duct, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A type is valid for flexible duct if it can be used to the flexible duct element.

#### Reference

FlexDuct Class

Autodesk.Revit.DB.Mechanical Namespace